import networkx as nx
class navi:
    instance = None
    # ノード（頂点）のリスト
    nodes = {
        "401教室": (116 , 187),
        "402教室": (185 , 187),
        "403教室": (500, 125),
        "404教室": (619, 125),
        "405教室": (700, 125),
        "406教室": (760, 125),
        "407教室": (825 , 125),
        "408教室": (885, 125) ,
        "教室棟女性トイレ": (933, 133),
        "中継_教室棟トイレ": (885, 170),
        "教室棟男性トイレ": (933, 170),
        "教室棟多目的トイレ": (915, 170),
        "教室棟渡り廊下入口": (423 , 137),
        "交流棟渡り廊下入口": (332, 137),
        "中継_交流棟トイレ": (310, 150),
        "自動販売機": (332, 148),
        "交流棟男性トイレ": (268, 150),
        "交流棟女性トイレ": (282, 150),
        "交流棟エレベーター": (292, 194),
        "中継_交流棟右上": (314 , 112),
        "中継_交流棟左上": (242 , 112),
        "中継_交流棟教室前": (242 , 187),
    }

    @classmethod
    def get_instance(cls):
        if cls.instance is None:
            cls.instance = cls.initialize()
        return cls.instance

    @classmethod
    def initialize(cls):
        print("初期化処理を実行")
        NODE_LIST =list(cls.nodes.keys())

        # エッジ（辺）のリスト
        # (始点, 終点, 重み)
        Graph_LIST = [
            ("403教室", "404教室", 1),
            ("404教室", "405教室", 1),
            ("405教室", "406教室", 1),
            ("406教室", "407教室", 1),
            ("407教室", "408教室", 1),
            ("408教室", "408教室", 1),
            ("407教室", "408教室", 1),
            ("408教室", "教室棟女性トイレ", 1),
            ("408教室", "中継_教室棟トイレ", 1),
            ("中継_教室棟トイレ", "教室棟男性トイレ", 1),
            ("中継_教室棟トイレ", "教室棟多目的トイレ", 1),
            ("403教室", "教室棟渡り廊下入口", 1),
            ("教室棟渡り廊下入口", "交流棟渡り廊下入口", 1),
            ("交流棟渡り廊下入口", "自動販売機", 1),
            ("交流棟渡り廊下入口", "中継_交流棟トイレ", 1),
            ("中継_交流棟トイレ", "交流棟男性トイレ", 1),
            ("中継_交流棟トイレ", "交流棟女性トイレ", 1),
            ("交流棟男性トイレ", "交流棟女性トイレ", 1),
            ("中継_交流棟トイレ", "交流棟エレベーター", 1),
            ("中継_交流棟トイレ", "交流棟渡り廊下入口", 1),
            ("交流棟渡り廊下入口", "中継_交流棟右上", 1),
            ("中継_交流棟右上", "中継_交流棟左上", 1),
            ("中継_交流棟左上", "中継_交流棟教室前", 1),
            ("中継_交流棟教室前", "402教室", 1),
            ("402教室", "401教室", 1),

        ]
        Graph = nx.Graph()
        Graph.add_nodes_from(NODE_LIST)
        Graph.add_weighted_edges_from(Graph_LIST)
        print("初期化されました")
        return Graph

    @classmethod
    def shortestPath(cls,start,end):
        Graph=cls.get_instance()
        # ダイクストラ法で最短経路とその重みを求める
        shortest_path = nx.dijkstra_path(Graph, start, end)
        # shortest_path_weight = nx.dijkstra_path_length(Graph, start, end)
        return shortest_path